In [1]:
import pandas as pd
import numpy as np

In [2]:
from env import host, username, password

In [8]:
#Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.
url = f'mysql+pymysql://{username}:{password}@{host}/employees'

In [9]:
#Use your function to obtain a connection to the employees database.
pd.read_sql(''' SELECT *
FROM employees
LIMIT 5 OFFSET 50
''', url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [13]:
#a. Intentionally make a typo in the database url. What kind of error message do you see?
url = f'mysql+pymysql://{username:{password}@{host}/employees'

SyntaxError: f-string: expecting '}' (231045927.py, line 2)

In [14]:
#b. Intentionally make an error in your SQL query. What does the error message look like?
pd.read_sql(''' SELECT *
FROM emloyees
LIMIT 5 OFFSET 50
''', url)

NoSuchModuleError: Can't load plugin: sqlalchemy.dialects:mysq.pymysql

In [18]:
#Read the employees and titles tables into two separate DataFrames.
df_e = pd.read_sql('''
SELECT *
FROM employees
LIMIT 100
''',url)

In [16]:
df_t = pd.read_sql('''
SELECT *
FROM titles as t
LIMIT 100
''',url)

In [17]:
df_t.shape

(100, 4)

In [19]:
df_e.shape

(100, 6)

In [20]:
# Display the summary statistics for each DataFrame.
df_t.describe()

             emp_no
count    100.000000
mean   10034.320000
std       18.656859
min    10001.000000
25%    10018.000000
50%    10035.500000
75%    10050.000000
max    10066.000000

In [21]:
df_e.describe()

             emp_no
count    100.000000
mean   10050.500000
std       29.011492
min    10001.000000
25%    10025.750000
50%    10050.500000
75%    10075.250000
max    10100.000000

In [22]:
# How many unique titles are in the titles DataFrame?
unique_titles = df_t['title'].nunique()
print(unique_titles)

6

In [25]:
oldest_date = df_t['to_date'].min()
print(oldest_date)

1987-01-27

In [26]:
most_recent = df_t['to_date'].max()
print(most_recent)

9999-01-01

#Exercises II

Copy the users and roles DataFrames from the examples above.

In [27]:
# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [28]:
# Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [29]:
# Output and read the documentation for the mpg dataset.
from pydataset import data
mpg = data('mpg')
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [30]:
# How many rows and columns are in the dataset?
mpg.shape

(234, 11)

In [40]:
# Check out your column names and perform any cleanup you may want on them.
mpg.rename(columns={'cty':'city','hwy':'highway'}).head()

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact

In [41]:
# Display the summary statistics for the dataset.
mpg.describe()

            displ         year         cyl         cty         hwy
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

In [33]:
# How many different manufacturers are there?
mpg['manufacturer'].nunique()

15

In [34]:
#How many different models are there?
mpg['model'].nunique()

38

In [46]:
# Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.
mpg['mileage_diff'] = mpg['cty'] - mpg['hwy'].head()
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_diff
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,-11.0
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,-8.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,-11.0
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,-9.0
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,-10.0

In [48]:
# Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.
mpg['avg_mileage'] = mpg['cty'] + mpg['hwy']/2
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_diff,avg_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,-11.0,32.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,-8.0,35.5
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,-11.0,35.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,-9.0,36.0
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,-10.0,29.0

In [50]:
# Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.
mpg['is_auto'] = mpg['trans'].apply(lambda x: 'auto' in x.lower())
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_diff,avg_mileage,is_auto
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,-11.0,32.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,-8.0,35.5,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,-11.0,35.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,-9.0,36.0,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,-10.0,29.0,True

In [54]:
# Using the mpg dataset, find out which manufacturer has the best miles per gallon on average?
avg_mpg_by_man = mpg.groupby('manufacturer').mean()[['cty', 'hwy']]
overall_avg_mpg = mpg[['cty','hwy']].mean().mean()

In [56]:
best_man = avg_mpg_by_man.apply(lambda x: (x['cty']+x['hwy'])/2, axis=1).idxmax()
print('The manufacturer with the best avg mpg is:', best_man)

The manufacturer with the best avg mpg is: honda

In [57]:
# Do automatic or manual cars have better miles per gallon?
auto_avg_mpg = mpg.loc[mpg['trans'].str.startswith('auto'),['cty','hwy']].mean().mean()
manual_avg_mpg = mpg.loc[mpg['trans'].str.startswith('man'),['cty','hwy']].mean().mean()
if auto_avg_mpg > manual_avg_mpg:
    print('Automatic cars have better avg mpg!')
else:
    print('Manual cars have better avg mpg!')

Manual cars have better avg mpg!

#Exercises III
Use your get_db_url function to help you explore the data from the chipotle database.

In [11]:
url = f'mysql+pymysql://{username}:{password}@{host}/chipotle'

In [16]:
df_c = pd.read_sql(''' SELECT *
FROM orders
''', url)

In [19]:
# What is the total price for each order?
pd.read_sql(''' select 
order_id, sum(cast(replace(item_price,'$','')as float)) as total
from orders
group by order_id
''',url).head()

   order_id  total
0         1  11.56
1         2  16.98
2         3  12.67
3         4  21.00
4         5  13.70

In [20]:
# What are the most popular 3 items?
pd.read_sql('''select item_name, SUM(quantity) as total_ordered
from orders
group by item_name
order by total_ordered desc
limit 3''',url)

             item_name  total_ordered
0         Chicken Bowl          761.0
1      Chicken Burrito          591.0
2  Chips and Guacamole          506.0

In [21]:
# Which item has produced the most revenue?
pd.read_sql(''' 
SELECT item_name, CONCAT('$',FORMAT(SUM(quantity*CAST(REPLACE(item_price,'$','') AS DECIMAL(10,2))),2)) as total_rev
FROM orders
GROUP BY item_name
ORDER BY SUM(quantity*
CAST(REPLACE(item_price,'$','') AS DECIMAL(10,2))) DESC
LIMIT 1''',url)

      item_name  total_rev
0  Chicken Bowl  $8,044.63

In [22]:
# Join the employees and titles DataFrames together.
url = f'mysql+pymysql://{username}:{password}@{host}/employees'

In [43]:
emp_t = pd.read_sql('''select *
from employees as e
join titles as t using (emp_no)
''',url)
emp_t

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01
...,...,...,...,...,...,...,...,...,...
443303,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Engineer,1987-08-30,1992-08-29
443304,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Senior Engineer,1992-08-29,9999-01-01
443305,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Senior Staff,1998-12-27,9999-01-01
443306,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Staff,1993-12-27,1998-12-27
443307,499999,1958-05-01,Sachin,Tsukuda,M,1997-11-30,Engineer,1997-11-30,9999-01-01

In [40]:
# For each title, find the hire date of the employee that was hired most recently with that title.
emp_t['hire_date'] = pd.to_datetime(emp_t['hire_date'])
most_recent_hire_dates = emp_t.groupby('title')['hire_date'].max()
print(most_recent_hire_dates)

title
Assistant Engineer   1999-12-24
Engineer             2000-01-28
Manager              1992-02-05
Senior Engineer      2000-01-01
Senior Staff         2000-01-13
Staff                2000-01-12
Technique Leader     1999-12-31
Name: hire_date, dtype: datetime64[ns]

In [50]:
# Write the code necessary to create a cross tabulation of the number of titles by department. 
dept_totals = pd.read_sql('''select d.dept_name, count(t.title)
from titles as t
join dept_emp as de using (emp_no)
join departments as d using (dept_no)
group by d.dept_name''',url).T
dept_totals

,0,1,2,3,4,5,6,7,8
dept_name,Customer Service,Development,Finance,Human Resources,Marketing,Production,Quality Management,Research,Sales
count(t.title),35075,125586,26070,26618,30138,107608,29346,31461,78001